export default function Footer() {
  return (
    <footer className=" bg-[#444]  ">
      <div className="container mx-auto w-full  ">
        <div className="mx-auto grid w-full lg:grid-cols-4 sm:grid-cols-2 gap-[20px] pt-[30px] px-8 ">
          {/* <!-- 1 --> */}
          <div>
            <ul className="flex flex-col gap-3  [&_li]:footersub ">
              <li>کارجویان</li>
              <li className="">سوالات متداول کارجویان</li>
              <li>قوانین و مقررات کارجویان</li>
              <li>لیست مشاغل</li>
              <li>آگهی های استخدام</li>
              <li>ایمیل های اطلاع رسانی</li>
              <li>رزومه ساز آنلاین</li>
              <li>آشنایی با شرکت ها</li>
            </ul>
          </div>

          {/* <!-- 2 --> */}
          <div>
            <ul className="flex flex-col gap-3 [&_li]:footersub">
              <li>میانبرها</li>
              <li>درخواست های من</li>
              <li>ایمیل های اطلاع رسانی</li>
              <li>رزومه ساز</li>
              <li>مشاهده رزومه</li>
              <li>تنظیمات حساب کاربری</li>
              <li>فرصت های شغلی پیشنهادی من</li>
            </ul>
          </div>
          {/* <!-- 3 --> */}
          <div>
            <ul className="flex flex-col gap-3 [&_li]:footersub">
              <li>جابینجا</li>
              <li>تماس با جابینجا</li>
              <li>جابینجا در رسانه ها</li>
              <li>راهنمای استفاده برای کارجویان</li>
              <li>وبلاگ</li>
            </ul>
          </div>
          {/* <!-- 4 --> */}
          <div>
            <ul className="flex flex-col items-center sm:items-start  [&_li]:footersub pt-8 sm:pt-0 ">
              <li className=" hidden sm:flex sm:w-full ">
                جابینجا در شبکه های اجتماعی
              </li>
              <li className=" flex md:justify-between justify-center gap-10 items-center pb-4  pt-[10px] ">
                <div className=" size-[26px] fill-white/80 ">
                  <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512">
                    <path d="M224.1 141c-63.6 0-114.9 51.3-114.9 114.9s51.3 114.9 114.9 114.9S339 319.5 339 255.9 287.7 141 224.1 141zm0 189.6c-41.1 0-74.7-33.5-74.7-74.7s33.5-74.7 74.7-74.7 74.7 33.5 74.7 74.7-33.6 74.7-74.7 74.7zm146.4-194.3c0 14.9-12 26.8-26.8 26.8-14.9 0-26.8-12-26.8-26.8s12-26.8 26.8-26.8 26.8 12 26.8 26.8zm76.1 27.2c-1.7-35.9-9.9-67.7-36.2-93.9-26.2-26.2-58-34.4-93.9-36.2-37-2.1-147.9-2.1-184.9 0-35.8 1.7-67.6 9.9-93.9 36.1s-34.4 58-36.2 93.9c-2.1 37-2.1 147.9 0 184.9 1.7 35.9 9.9 67.7 36.2 93.9s58 34.4 93.9 36.2c37 2.1 147.9 2.1 184.9 0 35.9-1.7 67.7-9.9 93.9-36.2 26.2-26.2 34.4-58 36.2-93.9 2.1-37 2.1-147.8 0-184.8zM398.8 388c-7.8 19.6-22.9 34.7-42.6 42.6-29.5 11.7-99.5 9-132.1 9s-102.7 2.6-132.1-9c-19.6-7.8-34.7-22.9-42.6-42.6-11.7-29.5-9-99.5-9-132.1s-2.6-102.7 9-132.1c7.8-19.6 22.9-34.7 42.6-42.6 29.5-11.7 99.5-9 132.1-9s102.7-2.6 132.1 9c19.6 7.8 34.7 22.9 42.6 42.6 11.7 29.5 9 99.5 9 132.1s2.7 102.7-9 132.1z" />
                  </svg>
                </div>
                <div className=" size-[26px] fill-white/80 ">
                  <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512">
                    <path d="M64 32C28.7 32 0 60.7 0 96V416c0 35.3 28.7 64 64 64H384c35.3 0 64-28.7 64-64V96c0-35.3-28.7-64-64-64H64zm297.1 84L257.3 234.6 379.4 396H283.8L209 298.1 123.3 396H75.8l111-126.9L69.7 116h98l67.7 89.5L313.6 116h47.5zM323.3 367.6L153.4 142.9H125.1L296.9 367.6h26.3z" />
                  </svg>
                </div>
                <div className=" size-[26px] fill-white/80 ">
                  <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512">
                    <path d="M248 8C111 8 0 119 0 256S111 504 248 504 496 393 496 256 385 8 248 8zM363 176.7c-3.7 39.2-19.9 134.4-28.1 178.3-3.5 18.6-10.3 24.8-16.9 25.4-14.4 1.3-25.3-9.5-39.3-18.7-21.8-14.3-34.2-23.2-55.3-37.2-24.5-16.1-8.6-25 5.3-39.5 3.7-3.8 67.1-61.5 68.3-66.7 .2-.7 .3-3.1-1.2-4.4s-3.6-.8-5.1-.5q-3.3 .7-104.6 69.1-14.8 10.2-26.9 9.9c-8.9-.2-25.9-5-38.6-9.1-15.5-5-27.9-7.7-26.8-16.3q.8-6.7 18.5-13.7 108.4-47.2 144.6-62.3c68.9-28.6 83.2-33.6 92.5-33.8 2.1 0 6.6 .5 9.6 2.9a10.5 10.5 0 0 1 3.5 6.7A43.8 43.8 0 0 1 363 176.7z" />
                  </svg>
                </div>
                <div className=" size-[26px] fill-white/80 ">
                  <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512">
                    <path d="M416 32H31.9C14.3 32 0 46.5 0 64.3v383.4C0 465.5 14.3 480 31.9 480H416c17.6 0 32-14.5 32-32.3V64.3c0-17.8-14.4-32.3-32-32.3zM135.4 416H69V202.2h66.5V416zm-33.2-243c-21.3 0-38.5-17.3-38.5-38.5S80.9 96 102.2 96c21.2 0 38.5 17.3 38.5 38.5 0 21.3-17.2 38.5-38.5 38.5zm282.1 243h-66.4V312c0-24.8-.5-56.7-34.5-56.7-34.6 0-39.9 27-39.9 54.9V416h-66.4V202.2h63.7v29.2h.9c8.9-16.8 30.6-34.5 62.9-34.5 67.2 0 79.7 44.3 79.7 101.9V416z" />
                  </svg>
                </div>
              </li>
              <li className="  pt-[20px] ">
                <a href="/">
                  {" "}
                  <img
                    src="https://jobinja.ir/assets/img/logo-gray.png"
                    alt="logo"
                    className="flex w-[56px] h-[32px] object-contain	 items-center  justify-center"
                  />
                </a>
              </li>
              <li className=" text-[12px] text-[#999]   ">
                با معتبرترین شرکت‌های کشور آشنا شوید و محل کار آینده خود را
                هوشمندانه انتخاب کنید.
              </li>
            </ul>
          </div>
        </div>

        <div className="text-center pt-[60px] text-[11px] text-[#999] pb-[20px] ">
          © ۱۴۰۳ - تمامی حقوق برای جابینجا محفوظ است.
        </div>
      </div>
    </footer>
  );
}
